OpenFOAMcases/BFSDNS/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          140;
        startFace       412854;
    }
    outlet
    {
        type            patch;
        nFaces          280;
        startFace       412994;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          986;
        startFace       413274;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1126;
        startFace       414260;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          207060;
        startFace       415386;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          207060;
        startFace       622446;
    }
)

// ************************************************************************* //
