OpenFOAMcases/BFSDNS/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
  inlet
  {
      type            fixedValue;
      value           $internalField;
  }

  "(upperWall|lowerWall)"
  {
      type            fixedValue;
      value           uniform 0;
  }

  outlet
  {
    type            zeroGradient;
  }

  "(front|back)"
  {
      type            empty;
  }
}


// ************************************************************************* //
