OpenFOAMcases/BFSDNS/system/stressComponents
type            turbulenceFields;
libs            (fieldFunctionObjects);

writeControl    writeTime;

fields          (devReff);
